define ch1_1 = Character("少女",what_prefix="\"",what_suffix="\"")
define ch1_2 = Character("士兵",what_prefix="\"",what_suffix="\"")
define ch1_3 = Character("士兵队长",what_prefix="\"",what_suffix="\"")

image bg1_1:
    contains:
        "images/背景/深夜王都小巷.png"
        size(1920,1080)

image bg1_2:
    contains:
        "images/背景/夜空.jpg"
        size(1920,1080)

label memory_1:

    scene bg1_1
    with dissolve

    ch1_1 "可恶。"

    ch1_1 "这些士兵实在是太难缠了。"

    with hpunch

    ch1_2 "再来两个人，搜查一下这边!"

    ch1_1 "糟糕!"

    "士兵们的脚步声逐渐逼近，我赶紧侧身躲进了小巷。"

    ch1_1 "千万…不要发现这里呀……"

    "小巷被两面高大的石墙夹在中间，隐没于阴冷潮湿的黑暗中。"

    "在这偌大的王都之中，现在只剩下小巷里的这一小片黑暗能保护我了。"

    "背靠着冰冷的石墙，我努力屏住呼吸，不发出任何一点声音。"

    "默默地祈求士兵的脚步声和金属铠甲的碰撞声尽快远去。"

    "…"

    ch1_2 "报告长官，这边没有人。"

    ch1_3 "好，你们几个，再去搜查一下那边。"

    ch1_3 "快点!一个魔法师的魔力不足以传送出包围圈。"

    ch1_2 "是!"

    ch1_1 "呼——"

    ch1_1 "看来暂时是安全了。"

    "我已经用尽了所有的魔力，尽量把自己往城外传送了。"

    "但是一个人的魔力总量实在是太少了，没法传送到太远的地方。"

    "包围圈的大小显然是精心设计出来的，即使我用尽了所有魔力，也无法直接传送出去。"

    ch1_1 "可恶……看来这些人都是计算好的。"

    ch1_1 "王国的这帮人……真的要把所有魔法师都赶尽杀绝吗?"

    ch1_1 "额……啊……"

    ch1_1 "不好……过度使用魔力的副作用也来了。"

    ch1_1 "好累……头也好疼……"

    ch1_1 "必须要赶紧恢复……然后尽快传送到安全的地方去。"

    ch1_1 "该死……不知道还要恢复多久才能再次使用魔法。"

    "也许要几个小时，也许要到明天早上……这个晚上可不好过了。"

    "对这种状态的我来说，无法使用魔法，就相当于毫无自保之力。"

    "我向周围望了望。"

    "即使是微弱的月光，也完全被石墙挡住了，几乎什么都看不清。"

    ch1_1 "不知道那些士兵什么时候还会回来……"

    ch1_1 "不能一直待在这里……得找个地方躲起来。"

    "在小巷外面不远处，依然可以看到依稀的灯光——也许是士兵的提灯。"

    ch1_1 "现在出去肯定是送死……"

    ch1_1 "没办法了，走一步看一步吧……"

    "我勉强拖着疲惫而痛苦的身躯，往小巷深处挪动，寻找能藏身的地方。"

    "黑暗中，瘦小但敏捷的啮齿动物在石砖的缝隙间窜来窜去。"

    "不过现在不是顾忌它们的时候了。"

    "我小心地扶着墙，尽量减轻发出的脚步声。"

    scene black
    with dissolve

    scene bg1_1
    with dissolve

    ch1_1 "不……怎么会这样……"

    "在小巷的深处，是另一面高大而冰冷的石墙。"

    "小巷里也没有任何通向外面的出口，连一扇门都没有。"

    "这个小巷是个死胡同。"

    ch1_1 "这可麻烦了……"

    "我环顾四周，试图找到一处藏身之所。"

    "然而小巷里什么杂物都没有，几乎可以一眼望到底。"

    "只有在石砖缝隙露出的泥土上，杂乱地生长着几株灌木。"

    "有一片灌木丛的体积不小，看起来还能勉强容纳下一个人。"

    "只是在夜色之中，没法看清它的密度能不能遮住一个人的身影。"

    ch1_1 "没办法了，只能在这里勉强躲一下了……"

    ch1_1 "可千万不要搜查到这里啊……"

    "我顾不得许多，尽可能小心地把自己塞了进去。"

    ch1_1 "唔……?"

    "正当我在灌木丛里休息时，一阵轻微的花香悄悄地从污泥和臭水沟的气味中显现了出来。"

    ch1_1 "原来这片灌木丛其实是花丛吗……"

    "之前一直只顾着躲藏，竟然都没有注意到。"

    ch1_1 "这个香气……好像有点熟悉。"

    "我努力地感受着微弱的香气。"

    "花香并不陌生。"

    "但是因为过度使用魔力，现在我头疼得厉害，已经没法集中注意力去分辨品种了。"

    ch1_1 "算了……估计就是种路边常见的野花吧。"

    ch1_1 "现在不是在意花花草草品种的时候了。"

    "我又紧张地看了一眼小巷的入口处。"

    "一切如常，并没有任何动静。"

    "虽然还能听到士兵的对话，但是听起来都在比较远的地方。"

    "看来之前钻进花丛发出的动静，并没有引来士兵。"

    ch1_1 "终于可以休息一会儿了……至少暂时是安全了。 "

    ch1_1 "说来……在这种阴暗的角落里，平时太阳都照不到的地方，竟然还有植物能开花……"

    ch1_1 "倒不如说，日日夜夜与黑暗和老鼠为伴……还有植物能长起来就是奇迹了。"

    "也许是因为置身花丛之中，花香逐渐浓郁了起来，逐渐盖过了阴暗小巷的臭气。"

    "我的心情也逐渐平静了下来，静静等待着魔力恢复。"

    "…"

    with Fade(0.5,2.0,0.5)

    "在小巷的入口处，巡夜士兵提灯的火光一直没有完全消失。"

    "时远时近的脚步声，也让人提心吊胆。"

    "不过我非常幸运，一直没有士兵认真检查过这个小巷。"

    "即使偶尔有士兵经过，也只是提着灯稍微看了一眼就离开了。"

    "也许是因为无名野花让人心安的香气，魔力恢复得也比预想中快一些。"

    "虽然非常非常勉强，但是现在的魔力已经差不多可以再使用一次魔法了。"

    ch1_1 "不知道再一次透支魔力，有多严重的副作用……"

    ch1_1 "算了，考虑这个也没什么用了。"

    ch1_1 "虽然没法传送到很远，但是现在必须行动了。"

    "我最后深吸了一次混杂着污泥和臭水沟气味的花香。"

    "再一次用尽身体仅剩的一点点魔力，拼命向远处发动了传送魔法"

    ch1_1 "{i}agnoeras thesy ontallagy ego estia!*字体"

    scene white
    with dissolve

    scene bg1_2
    with dissolve

    ch1_1 "呃……"

    "一阵天旋地转之后，我坠落在了柔软的地面上。"

    "仰面躺着，双手能触摸到潮湿泥土的触感以及零零星星的植物。"

    "夏夜闪烁的星空，连带着青草的清香和蝉鸣声，随即也映入了眼中。"

    ch1_1 "成功了……"

    ch1_1 "这里大概是王都城外的郊区吧……安全的地方。"

    ch1_1 "呼——"

    "我安心地闭上了眼睛，任由意识坠入了无边的夜空。"


    scene black
    with dissolve

    return
